---
kind: other
id: Properties.T:Autodesk.Revit.DB.SymbolicCurve
source: html/81dc5ed6-dcbc-adf5-bfaf-8efe524fb902.htm
---
# SymbolicCurve Properties

The id of the assembly instance to which the element belongs.